; domain
(define (domain Rover)
  (:requirements :typing)
  (:types rover waypoint store camera mode lander objective)

  (:predicates (at ?x - rover ?y - waypoint) 
               (at_lander ?x - lander ?y - waypoint)
               (can_traverse ?r - rover ?x - waypoint ?y - waypoint)
               (equipped_for_soil_analysis ?r - rover)
               (equipped_for_rock_analysis ?r - rover)
               (equipped_for_imaging ?r - rover)
               (empty ?s - store)
               (have_rock_analysis ?r - rover ?w - waypoint)
               (have_soil_analysis ?r - rover ?w - waypoint)
               (full ?s - store)
               (calibrated ?c - camera ?r - rover) 
               (supports ?c - camera ?m - mode)
               (available ?r - rover)
               (visible ?w - waypoint ?p - waypoint)
               (have_image ?r - rover ?o - objective ?m - mode)
               (communicated_soil_data ?w - waypoint)
               (communicated_rock_data ?w - waypoint)
               (communicated_image_data ?o - objective ?m - mode)
               (at_soil_sample ?w - waypoint)
               (at_rock_sample ?w - waypoint)
               (visible_from ?o - objective ?w - waypoint)
               (store_of ?s - store ?r - rover)
               (calibration_target ?i - camera ?o - objective)
               (on_board ?i - camera ?r - rover)
               (channel_free ?l - lander))
  
  ;; 移動
  (:action navigate
           :parameters (?x - rover ?y - waypoint ?z - waypoint) 
           :precondition (and (can_traverse ?x ?y ?z)
                              (available ?x)
                              (at ?x ?y) 
                              (visible ?y ?z))
           :effect (and (not (at ?x ?y))
                        (at ?x ?z)))

  ;; 土をカゴに入れる
  (:action sample_soil
           :parameters (?x - rover ?s - store ?p - waypoint)
           :precondition (and (at ?x ?p)
                              (at_soil_sample ?p)
                              (equipped_for_soil_analysis ?x)
                              (store_of ?s ?x)
                              (empty ?s))
           :effect (and (not (empty ?s))
                        (full ?s)
                        (have_soil_analysis ?x ?p)
                        (not (at_soil_sample ?p))))

  ;; 石をカゴに入れる 内容は土と同じ
  (:action sample_rock
           :parameters (?x - rover ?s - store ?p - waypoint)
           :precondition (and (at ?x ?p)
                              (at_rock_sample ?p)
                              (equipped_for_rock_analysis ?x)
                              (store_of ?s ?x)
                              (empty ?s))
           :effect (and (not (empty ?s))
                        (full ?s)
                        (have_rock_analysis ?x ?p)
                        (not (at_rock_sample ?p))))

  ;; かごの中身を捨てる
  (:action drop
           :parameters (?x - rover ?y - store)
           :precondition (and (store_of ?y ?x)
                              (full ?y))
           :effect (and (not (full ?y)) (empty ?y)))

  ;; カメラの焦点を合わせる
  (:action calibrate
           :parameters (?r - rover ?i - camera ?t - objective ?w - waypoint)
           :precondition (and (equipped_for_imaging ?r)
                              (calibration_target ?i ?t)
                              (at ?r ?w)
                              (visible_from ?t ?w)
                              (on_board ?i ?r))
           :effect (calibrated ?i ?r))

  ;; 写真を取る
  (:action take_image
           :parameters (?r - rover ?p - waypoint ?o - objective ?i - camera ?m - mode)
           :precondition (and (calibrated ?i ?r)
                              (on_board ?i ?r)
                              (equipped_for_imaging ?r)
                              (supports ?i ?m)
                              (visible_from ?o ?p)
                              (at ?r ?p))
           :effect (and (have_image ?r ?o ?m)
                        (not (calibrated ?i ?r))))

  ;; データを送信
  (:action communicate_soil_data
           :parameters (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
           :precondition (and (at ?r ?x)
                              (at_lander ?l ?y)
                              (have_soil_analysis ?r ?p)
                              (visible ?x ?y)
                              (available ?r)
                              (channel_free ?l))
           :effect (and (not (available ?r))
                        (not (channel_free ?l))
                        (communicated_soil_data ?p)))

  (:action communicate_rock_data
           :parameters (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
           :precondition (and (at ?r ?x)
                              (at_lander ?l ?y)
                              (have_rock_analysis ?r ?p)
                              (visible ?x ?y)
                              (available ?r)
                              (channel_free ?l))
           :effect (and (not (available ?r))
                        (not (channel_free ?l))
                        (communicated_rock_data ?p)))

  (:action communicate_image_data
           :parameters (?r - rover ?l - lander ?o - objective ?m - mode ?x - waypoint ?y - waypoint)
           :precondition (and (at ?r ?x)
                              (at_lander ?l ?y)
                              (have_image ?r ?o ?m)
                              (visible ?x ?y)
                              (available ?r)
                              (channel_free ?l))
           :effect (and (not (available ?r))
                        (not (channel_free ?l))
                        (communicated_image_data ?o ?m)))

  (:action end_communication
           :parameters (?r - rover ?l - lander ?m - mode ?x - waypoint ?y - waypoint)
           :precondition (and (at ?r ?x)
                              (at_lander ?l ?y)
                              (visible ?x ?y))
           :effect (and (channel_free ?l)
                        (available ?r))))

; problem
(define (problem roverprob08) (:domain Rover)
(:objects
	general - Lander
	colour high_res low_res - Mode
	rover0 rover1 rover2 rover3 - Rover
	rover0store rover1store rover2store rover3store - Store
	waypoint0 waypoint1 waypoint2 waypoint3 waypoint4 waypoint5 - Waypoint
	camera0 camera1 camera2 camera3 - Camera
	objective0 objective1 objective2 - Objective
	)
(:init
	(visible waypoint0 waypoint1)
	(visible waypoint1 waypoint0)
	(visible waypoint0 waypoint3)
	(visible waypoint3 waypoint0)
	(visible waypoint1 waypoint5)
	(visible waypoint5 waypoint1)
	(visible waypoint2 waypoint0)
	(visible waypoint0 waypoint2)
	(visible waypoint2 waypoint1)
	(visible waypoint1 waypoint2)
	(visible waypoint2 waypoint3)
	(visible waypoint3 waypoint2)
	(visible waypoint2 waypoint4)
	(visible waypoint4 waypoint2)
	(visible waypoint3 waypoint4)
	(visible waypoint4 waypoint3)
	(visible waypoint3 waypoint5)
	(visible waypoint5 waypoint3)
	(visible waypoint4 waypoint0)
	(visible waypoint0 waypoint4)
	(visible waypoint4 waypoint1)
	(visible waypoint1 waypoint4)
	(visible waypoint5 waypoint2)
	(visible waypoint2 waypoint5)
	(visible waypoint5 waypoint4)
	(visible waypoint4 waypoint5)
	(at_soil_sample waypoint1)
	(at_rock_sample waypoint2)
	(at_soil_sample waypoint3)
	(at_rock_sample waypoint3)
	(at_soil_sample waypoint4)
	(at_rock_sample waypoint4)
	(at_rock_sample waypoint5)
	(at_lander general waypoint0)
	(channel_free general)
	(at rover0 waypoint2)
	(available rover0)
	(store_of rover0store rover0)
	(empty rover0store)
	(equipped_for_soil_analysis rover0)
	(equipped_for_rock_analysis rover0)
	(can_traverse rover0 waypoint2 waypoint0)
	(can_traverse rover0 waypoint0 waypoint2)
	(can_traverse rover0 waypoint2 waypoint3)
	(can_traverse rover0 waypoint3 waypoint2)
	(can_traverse rover0 waypoint2 waypoint4)
	(can_traverse rover0 waypoint4 waypoint2)
	(can_traverse rover0 waypoint0 waypoint1)
	(can_traverse rover0 waypoint1 waypoint0)
	(can_traverse rover0 waypoint3 waypoint5)
	(can_traverse rover0 waypoint5 waypoint3)
	(at rover1 waypoint2)
	(available rover1)
	(store_of rover1store rover1)
	(empty rover1store)
	(equipped_for_rock_analysis rover1)
	(equipped_for_imaging rover1)
	(can_traverse rover1 waypoint2 waypoint0)
	(can_traverse rover1 waypoint0 waypoint2)
	(can_traverse rover1 waypoint2 waypoint3)
	(can_traverse rover1 waypoint3 waypoint2)
	(can_traverse rover1 waypoint2 waypoint5)
	(can_traverse rover1 waypoint5 waypoint2)
	(can_traverse rover1 waypoint0 waypoint1)
	(can_traverse rover1 waypoint1 waypoint0)
	(can_traverse rover1 waypoint3 waypoint4)
	(can_traverse rover1 waypoint4 waypoint3)
	(at rover2 waypoint2)
	(available rover2)
	(store_of rover2store rover2)
	(empty rover2store)
	(equipped_for_rock_analysis rover2)
	(equipped_for_imaging rover2)
	(can_traverse rover2 waypoint2 waypoint0)
	(can_traverse rover2 waypoint0 waypoint2)
	(can_traverse rover2 waypoint2 waypoint1)
	(can_traverse rover2 waypoint1 waypoint2)
	(can_traverse rover2 waypoint2 waypoint4)
	(can_traverse rover2 waypoint4 waypoint2)
	(can_traverse rover2 waypoint2 waypoint5)
	(can_traverse rover2 waypoint5 waypoint2)
	(can_traverse rover2 waypoint0 waypoint3)
	(can_traverse rover2 waypoint3 waypoint0)
	(at rover3 waypoint3)
	(available rover3)
	(store_of rover3store rover3)
	(empty rover3store)
	(equipped_for_soil_analysis rover3)
	(equipped_for_rock_analysis rover3)
	(equipped_for_imaging rover3)
	(can_traverse rover3 waypoint3 waypoint0)
	(can_traverse rover3 waypoint0 waypoint3)
	(can_traverse rover3 waypoint3 waypoint2)
	(can_traverse rover3 waypoint2 waypoint3)
	(can_traverse rover3 waypoint3 waypoint4)
	(can_traverse rover3 waypoint4 waypoint3)
	(can_traverse rover3 waypoint0 waypoint1)
	(can_traverse rover3 waypoint1 waypoint0)
	(can_traverse rover3 waypoint2 waypoint5)
	(can_traverse rover3 waypoint5 waypoint2)
	(on_board camera0 rover3)
	(calibration_target camera0 objective1)
	(supports camera0 colour)
	(supports camera0 high_res)
	(supports camera0 low_res)
	(on_board camera1 rover3)
	(calibration_target camera1 objective0)
	(supports camera1 colour)
	(supports camera1 high_res)
	(on_board camera2 rover1)
	(calibration_target camera2 objective0)
	(supports camera2 colour)
	(supports camera2 high_res)
	(supports camera2 low_res)
	(on_board camera3 rover2)
	(calibration_target camera3 objective1)
	(supports camera3 colour)
	(supports camera3 low_res)
	(visible_from objective0 waypoint0)
	(visible_from objective0 waypoint1)
	(visible_from objective0 waypoint2)
	(visible_from objective1 waypoint0)
	(visible_from objective2 waypoint0)
	(visible_from objective2 waypoint1)
	(visible_from objective2 waypoint2)
)

(:goal (and
(communicated_soil_data waypoint1)
(communicated_soil_data waypoint3)
(communicated_soil_data waypoint4)
(communicated_rock_data waypoint5)
(communicated_rock_data waypoint4)
(communicated_image_data objective0 low_res)
(communicated_image_data objective0 high_res)
(communicated_image_data objective2 low_res)
	)
)
)

; plan
1. (navigate rover3 waypoint3 waypoint4)
   deleted: (at rover3 waypoint3)
   added: (at rover3 waypoint4)
   goals met: 0 of 8
2. (sample_rock rover3 rover3store waypoint4)
   deleted: (empty rover3store) (at_rock_sample waypoint4)
   added: (full rover3store) (have_rock_analysis rover3 waypoint4)
   goals met: 0 of 8
3. (calibrate rover1 camera2 objective0 waypoint2)
   added: (calibrated camera2 rover1)
   goals met: 0 of 8
4. (navigate rover0 waypoint2 waypoint0)
   deleted: (at rover0 waypoint2)
   added: (at rover0 waypoint0)
   goals met: 0 of 8
5. (navigate rover0 waypoint0 waypoint1)
   deleted: (at rover0 waypoint0)
   added: (at rover0 waypoint1)
   goals met: 0 of 8
6. (sample_soil rover0 rover0store waypoint1)
   deleted: (empty rover0store) (at_soil_sample waypoint1)
   added: (full rover0store) (have_soil_analysis rover0 waypoint1)
   goals met: 0 of 8
7. (drop rover3 rover3store)
   deleted: (full rover3store)
   added: (empty rover3store)
   goals met: 0 of 8
8. (communicate_rock_data rover3 general waypoint4 waypoint4 waypoint0)
   deleted: (available rover3) (channel_free general)
   added: (communicated_rock_data waypoint4)
   goals met: 1 of 8
9. (end_communication rover3 general colour waypoint4 waypoint0)
   added: (channel_free general) (available rover3)
   goals met: 1 of 8
10. (take_image rover1 waypoint2 objective2 camera2 low_res)
   deleted: (calibrated camera2 rover1)
   added: (have_image rover1 objective2 low_res)
   goals met: 1 of 8
11. (calibrate rover1 camera2 objective0 waypoint2)
   added: (calibrated camera2 rover1)
   goals met: 1 of 8
12. (take_image rover1 waypoint2 objective0 camera2 low_res)
   deleted: (calibrated camera2 rover1)
   added: (have_image rover1 objective0 low_res)
   goals met: 1 of 8
13. (calibrate rover1 camera2 objective0 waypoint2)
   added: (calibrated camera2 rover1)
   goals met: 1 of 8
14. (take_image rover1 waypoint2 objective0 camera2 high_res)
   deleted: (calibrated camera2 rover1)
   added: (have_image rover1 objective0 high_res)
   goals met: 1 of 8
15. (sample_soil rover3 rover3store waypoint4)
   deleted: (empty rover3store) (at_soil_sample waypoint4)
   added: (full rover3store) (have_soil_analysis rover3 waypoint4)
   goals met: 1 of 8
16. (drop rover3 rover3store)
   deleted: (full rover3store)
   added: (empty rover3store)
   goals met: 1 of 8
17. (navigate rover3 waypoint4 waypoint3)
   deleted: (at rover3 waypoint4)
   added: (at rover3 waypoint3)
   goals met: 1 of 8
18. (sample_soil rover3 rover3store waypoint3)
   deleted: (empty rover3store) (at_soil_sample waypoint3)
   added: (full rover3store) (have_soil_analysis rover3 waypoint3)
   goals met: 1 of 8
19. (communicate_soil_data rover3 general waypoint4 waypoint3 waypoint0)
   deleted: (available rover3) (channel_free general)
   added: (communicated_soil_data waypoint4)
   goals met: 2 of 8
20. (end_communication rover3 general colour waypoint3 waypoint0)
   added: (channel_free general) (available rover3)
   goals met: 2 of 8
21. (communicate_soil_data rover3 general waypoint3 waypoint3 waypoint0)
   deleted: (available rover3) (channel_free general)
   added: (communicated_soil_data waypoint3)
   goals met: 3 of 8
22. (end_communication rover3 general colour waypoint3 waypoint0)
   added: (channel_free general) (available rover3)
   goals met: 3 of 8
23. (communicate_soil_data rover0 general waypoint1 waypoint1 waypoint0)
   deleted: (available rover0) (channel_free general)
   added: (communicated_soil_data waypoint1)
   goals met: 4 of 8
24. (end_communication rover3 general colour waypoint3 waypoint0)
   added: (channel_free general)
   goals met: 4 of 8
25. (navigate rover2 waypoint2 waypoint5)
   deleted: (at rover2 waypoint2)
   added: (at rover2 waypoint5)
   goals met: 4 of 8
26. (sample_rock rover2 rover2store waypoint5)
   deleted: (empty rover2store) (at_rock_sample waypoint5)
   added: (full rover2store) (have_rock_analysis rover2 waypoint5)
   goals met: 4 of 8
27. (communicate_image_data rover1 general objective2 low_res waypoint2 waypoint0)
   deleted: (available rover1) (channel_free general)
   added: (communicated_image_data objective2 low_res)
   goals met: 5 of 8
28. (end_communication rover1 general colour waypoint2 waypoint0)
   added: (channel_free general) (available rover1)
   goals met: 5 of 8
29. (communicate_image_data rover1 general objective0 low_res waypoint2 waypoint0)
   deleted: (available rover1) (channel_free general)
   added: (communicated_image_data objective0 low_res)
   goals met: 6 of 8
30. (end_communication rover1 general colour waypoint2 waypoint0)
   added: (channel_free general) (available rover1)
   goals met: 6 of 8
31. (navigate rover2 waypoint5 waypoint2)
   deleted: (at rover2 waypoint5)
   added: (at rover2 waypoint2)
   goals met: 6 of 8
32. (communicate_image_data rover1 general objective0 high_res waypoint2 waypoint0)
   deleted: (available rover1) (channel_free general)
   added: (communicated_image_data objective0 high_res)
   goals met: 7 of 8
33. (end_communication rover3 general colour waypoint3 waypoint0)
   added: (channel_free general)
   goals met: 7 of 8
34. (communicate_rock_data rover2 general waypoint5 waypoint2 waypoint0)
   deleted: (available rover2) (channel_free general)
   added: (communicated_rock_data waypoint5)
   goals met: 8 of 8
